Documents/ВыплатаЗаработнойПлаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ВыплатаЗаработнойПлаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКасса</Name>
					<Comment>выплата Нал Безнал</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокФизЛиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыплатаЗаработнойПлаты/Ext/ManagerModule.bsl
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ТабДок = ПечатьПлатежнаяВедомость(МассивОбъектов, ОбъектыПечати);
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Т53", "Т53", ТабДок,, "Документ.ВыплатаЗаработнойПлаты.Т53");
	ТабДок.АвтоМасштаб = Истина;
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

Функция ПечатьПлатежнаяВедомость(Документ, ОбъектыПечати) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПараметрыПечати_Т53";
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.КоличествоЭкземпляров = 1;
	ТабДок.Защита = Истина;
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Макет = Документы.ВыплатаЗаработнойПлаты.ПолучитьМакет("Т53");
	
	ШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	ИтогПоЛисту = Макет.ПолучитьОбласть("ИтогПоЛисту");	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Ссылка", Документ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыплатаЗаработнойПлаты.Ссылка,
	|	ВыплатаЗаработнойПлаты.СписокФизЛиц.(
	|		Ссылка,
	|		НомерСтроки,
	|		Выплачено,
	|		Комментарий,
	|		Сотрудник,
	|		Статья
	|	)
	|ИЗ
	|	Документ.ВыплатаЗаработнойПлаты КАК ВыплатаЗаработнойПлаты
	|ГДЕ
	|	ВыплатаЗаработнойПлаты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
		
		ШапкаДокумента.Параметры.НазваниеОрганизации = Документ.Подразделение.ОрганизацияДляФизЛиц.ПолноеНаименование;
		ШапкаДокумента.Параметры.Подразделение = Документ.Подразделение;
		ШапкаДокумента.Параметры.СуммаДок = ЧислоПрописью(Документ.СуммаДокумента, ФормСтрока, ПарПредмета);
		ШапкаДокумента.Параметры.СуммаДокРублей = Цел(Документ.СуммаДокумента);
		ШапкаДокумента.Параметры.СуммаДокКопеек = 100 * (Документ.СуммаДокумента - Цел(Документ.СуммаДокумента));
		ШапкаДокумента.Параметры.РуководительДолжность = "Директор";
		ШапкаДокумента.Параметры.Руководитель = Документ.Подразделение.Руководитель;
		ШапкаДокумента.Параметры.ГлавныйБухгалтер = Документ.Автор;
		ШапкаДокумента.Параметры.Номер = Документ.Номер;
		ШапкаДокумента.Параметры.Дата = Формат(Документ.Дата, "ДФ=dd.MM.yyyy");
		ШапкаДокумента.Параметры.Комментарий = Документ.Комментарий;
		
		ТабДок.Вывести(ШапкаДокумента);
		//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДок.Вывести(Шапка);

		ВыборкаСтроки = Выборка.СписокФизЛиц.Выбрать();
		
		Пока ВыборкаСтроки.Следующий() Цикл
			
			Строка.Параметры.Заполнить(ВыборкаСтроки);
			ТабДок.Вывести(Строка);
			
		КонецЦикла;
		
		ИтогПоЛисту.Параметры.ИтогоНаСтранице = Документ.СуммаДокумента; 
		ТабДок.Вывести(ИтогПоЛисту);
		
		Подвал.Параметры.ВсегоВыплачено = ЧислоПрописью(Документ.СуммаДокумента, ФормСтрока, ПарПредмета);
		Подвал.Параметры.КассирДолжность = "Бухгалтер";
		Подвал.Параметры.Кассир = Документ.Автор;
		ТабДок.Вывести(Подвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, НомерСтрокиНачало, ОбъектыПечати, Документ);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции
